USE [20.101-09-Restaurant]
GO

INSERT INTO [dbo].[Employees]           
     VALUES
           (1, 'Илья', 'Ярославович', 'Кузьмин'),
		   (2, 'Ярослав', NUll, 'Демидов'),
		   (3, 'Мария', 'Степановна', 'Лаврова'),
		   (4, 'Дмитрий', 'Родионович', 'Савин'),
		   (5, 'Иван', 'Семёнович', 'Лукьянов'),
		   (6, 'Дария', 'Артёмовна', 'Кондратьева'),
		   (11, 'Владимир', 'Владимирович', 'Владимиров')

INSERT INTO [dbo].[Posts]           
     VALUES
           (1, 'Генеральный деректор', 60000.00),
		   (2, 'Сотрудник отдела кадров', 40000.00),
		   (3, 'Менеджер', 45000.00),
		   (4, 'Повар', 50000.00),
		   (5, 'Официант', 30000.00),
		   (6, 'Шеф повар', 55000.00)

INSERT INTO [dbo].[EmployeeInformation]           
     VALUES
           (1, '05.12.1988', '7(495)029-93-02', '4126', '780114', 1),
		   (2, '02.09.1984', '7(495)818-09-87', '4766', '939779', 2),
		   (3, '24.06.1968', '7(495)191-74-20', '4250', '564888', 3),
		   (4, '23.05.1995', '7(495)633-07-35', '4293', '198073', 4),
		   (5, '11.03.1994', '7(495)547-85-92', '4157', '799510', 5),
		   (6, '09.11.1981', '7(495)113-00-16', '4197', '237466', 6),
		   (11, '23.08.1993', '7(495)212-05-83', '4636', '242344', 4)
GO

INSERT INTO [dbo].[Authorization]           
     VALUES
           (2, 'HRE1', 'AB38EADAEB746599F2C1EE90F8267F31F467347462764A24D71AC1843EE77FE3'),
		   (3, 'meneg1', 'AB38EADAEB746599F2C1EE90F8267F31F467347462764A24D71AC1843EE77FE3'),
		   (4, 'sushef1', 'AB38EADAEB746599F2C1EE90F8267F31F467347462764A24D71AC1843EE77FE3'),
		   (5, 'oficiant1', 'AB38EADAEB746599F2C1EE90F8267F31F467347462764A24D71AC1843EE77FE3'),
		   (11, 'usertest', 'AB38EADAEB746599F2C1EE90F8267F31F467347462764A24D71AC1843EE77FE3')
GO

INSERT INTO [dbo].[OrderStatus]           
     VALUES
           (1, 'Готовится'),
		   (2, 'Готовый')
GO

INSERT INTO [dbo].[TablesStatus]          
     VALUES
           (1, 'Занят'),
		   (2, 'Бронь'),
		   (3, 'Свободен')
GO

INSERT INTO [dbo].[Tables]          
     VALUES
           (1, 4, 1),
		   (2, 6, 2),
		   (3, 4, 3),
		   (4, 4, 2),
		   (5, 6, 1)
GO

INSERT INTO [dbo].[Orders]        
     VALUES
           (1, 550.00, 1, 1),
		   (2, 1300.00, 2, 2),
		   (3, 250.00, 1, 3),
		   (4, 950.00, 2, 4),
		   (5, 1200.00, 1, 5)
GO

INSERT INTO [dbo].[TypeOfTheDishes]        
     VALUES
           (1, 'Первое блюдо'),
		   (2, 'Второе блюдо'),
		   (3, 'Напиток'),
		   (4, 'Закуска'),
		   (5, 'Десерт'),
		   (6, 'Роллы')
GO

INSERT INTO [dbo].[Dishes]      
     VALUES
           (1, 'Бефстроганов из говядины со сметаной', 300.00, 2, 0.210),
		   (2, 'Запеченная "Филадельфия"', 250.00, 6, 0.110),
		   (3, 'Бефстроганов из говядины со сметаной', 800.00, 2, 0.200),
		   (4, 'Сырный суп с куриной грудкой', 400.00, 1, 0.500),
		   (5, 'Апельсиновый напиток с мятой', 250.00, 3, 1.000)
GO

INSERT INTO [dbo].[OrderDishes]      
     VALUES
           (1, 1, 1),
		   (2, 1, 3),
		   (3, 2, 2),
		   (4, 2, 3),
		   (5, 2, 5),
		   (6, 3, 5),
		   (7, 4, 1),
		   (8, 4, 4),
		   (9, 4, 5),
		   (10, 5, 3),
		   (11, 5, 4)
GO

INSERT INTO [dbo].[Products]    
     VALUES
           (1, 'Кура окорок с кожей' ,30000.00, 30	, 60.000),
		   (2,	'Филе куриной грудки',	50000.00,	15	,105.000),
		   (3,	'Кунжут белый',	50.00,	365,	60.000),
		   (4,	'Кунжут черный',	30.00,	365,	60.000),
		   (5,	'Масло подсолнечное'	,6000.00,	365,	60.000),
		   (6,	'Масло фритюрное',	13000.00,	365,	130.000),
		   (7,	'Молоко 2,5%',	2700.00,	90,	30.000),
		   (8,	'Перец красный молотый сладкий',	300.00,	1095,	1.000),
		   (9,	'Сахар-песок',	1250.00,	2920,	50.000),
		   (10,	'Соль крупная',	200.00,	2920,	10.000),
		   (11,	'Яйцо куриное'	,210.00,	7,	1.500),
		   (12,	'Ветчина "Альпийская"',	3000.00,	30,	30.000),
		   (13,	'Огурец',	1000.00,	30,	20.000),
		   (14,	'Помидор',	800.00,	30,	20.000),
		   (15,	'Мука',	5000.00,	1825,	50.000),
		   (16,	'Соль мелкая',	200.00,	2920,	10.000),
		   (17,	'Говядина',	500.00,	15,	1.000),
		   (18,	'Репчатый лук',	20.00,	60,	0.500),
		   (19,	'Сметана',	50.00,	7,	0.200),
		   (20,	'Томатная паста',	20.00,	128,	0.500),
		   (21,	'Сливочное масло',	20.00,	30,	0.100),
		   (22,	'Рис',	50.00,	365,	1.000),
		   (23,	'Водоросли "Нори"',	100.00,	30,	1.000),
		   (24,	'Малосольная семга',	500.00,	7,	1.000),
		   (25,	'Сливочный сыр',	100.00,	7,	0.200),
		   (26,	'Майонез',	50.00,	7,	0.300),
		   (27,	'Креветки тигровые', 	500.00,	7,	0.400),
		   (28,	'Соус томатный',	50.00,	7,	1.000),
		   (29,	'Масло оливковое', 	50.00,	14,	1.000),
		   (30,	'Морковь',	50.00,	30,	2.000),
		   (31,	'Картофель',	50.00,	128,	3.000),
		   (32,	'Сыр плавленный',	100.00,	14,	0.500),
		   (33,	'Вода', 100.00,	14,	10.000),
		   (34,	'Апельсин',	50.00,	14,	2.000),
		   (35,	'Мята',	50.00,	14,	1.000),
		   (36,	'Лед',100.00,	14,	5.000)
GO

INSERT INTO [dbo].[ConsituentDishes]   
     VALUES
           (1,	1,	17),
		   (2,	1,	18),
		   (3,	1,	19),
		   (4,	1,	20),
		   (5,	1,	21),
		   (6,	2,	22),
		   (7,	2,	23),
		   (8,	2,	24),
		   (9,	2,	25),
		   (10,	2,	26),
		   (11,	2,	13),
		   (12,	3,	27),
		   (13,	3,	28),
		   (14,	3,	29),
		   (15,	4,	30),
		   (16,	4,	31),
		   (17,	4,	32),
		   (18,	4,	33),
		   (19,	4,	2),
		   (20,	5,	33),
		   (21,	5,	9),
		   (22,	5,	34),
		   (23,	5,	35),
		   (24,	5,	36)
GO

INSERT INTO [dbo].[Purchases]
     VALUES
           (1, '14.10.2022'),
		   (2, '14.10.2021'),
		   (3, '10.09.2022'),
		   (4, '28.09.2022'),
		   (5, '17.10.2022')
GO

INSERT INTO [dbo].[PurchasesProducts]
     VALUES
           (1,	1,	1),
		   (2,	1,	2),
		   (3,	1,	3),
		   (4,	2,	4),
		   (5,	2,	1),
		   (6,	2,	5),
		   (7,	2,	10),
		   (8,	3,	2),
		   (9,	3,	14),
		   (10,	3,	12),
		   (11,	4,	15),
		   (12,	4,	8),
		   (13,	4,	9),
		   (14,	4,	6),
		   (15,	5,	13),
		   (16,	5,	12),
		   (17,	5,	11),
		   (18,	5,	5),
		   (19,	5,	3),
		   (20,	5,	1),
		   (21,	5,	6)
GO

INSERT INTO [dbo].[Check]           
     VALUES
           (1, 5, 1, '05.07.2022'),
		   (2, 5, 2, '14.08.2022'),
		   (3, 5, 3, '23.08.2022'),
		   (4, 5, 4, '07.07.2022'),
		   (5, 5, 5, '15.09.2022')
GO